/*
 * TCAN45x.h
 *
 *  Updated on Feb 22, 2018 for TMS570 MCU; QJ Wang; qjwang@ti.com
 *  First created on: Apr 3, 2017 for MSP430 MCU; Jonathan Valdez
 *
 *  Information: This file stores the general setup methods to be used to setup the TCAN4550
 */
/*
* Copyright (C) 2009-2015 Texas Instruments Incorporated - www.ti.com
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the
*    distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  INCLUDING NEGLIGENCE OR OTHERWISE ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
*/

#include "sys_common.h"


#define CONFIG_SUCCESS_FIRST	0x02
#define CONFIG_SUCCESS			0x01
#define CONFIG_FAIL				0x00

#define STATUS_SUCCESS  0x01
#define STATUS_FAIL     0x00

#define SPI_READ_SUCCESS  0x01
#define SPI_READ_FAIL     0x00

typedef struct TCAN45x0_DevID_reg
{
    uint32 Device_ID0;   //TCAN
    uint32 Device_ID1;   //4550
    uint32 Device_REV;
}TCAN45x0_DevID_reg_t;


typedef struct TCAN45x0_Device_config_reg
{
    uint32 CONFIG_DEV_MODE_PINS;
    uint32 CONFIG_DEV_TIMESTAMP_PRESCALER;
    uint32 CONFIG_DEV_TEST_REGISTERS;
    uint32 CONFIG_DEV_IE;
}TCAN45x0_Device_config_reg_t;

typedef struct TCAN45x0_MCAN_config_reg
{
    uint32 CONFIG_MCAN_DBTP;     //0x100C
    uint32 CONFIG_MCAN_TEST;     //0x1010
    uint32 CONFIG_MCAN_RAMWD;    //0x1014
    uint32 CONFIG_MCAN_CCCR;     //0x1018
    uint32 CONFIG_MCAN_NBTP;     //0x101C

    uint32 CONFIG_MCAN_TSCC;     //0x1020
    uint32 CONFIG_MCAN_TOCC;     //0x1028

    uint32 CONFIG_MCAN_TDCR;     //0x1048
    uint32 CONFIG_MCAN_IR;       //0x1050
    uint32 CONFIG_MCAN_IE;       //0x1054
    uint32 CONFIG_MCAN_ILS;      //0x1058
    uint32 CONFIG_MCAN_ILE;      //0x105C

    uint32 CONFIG_MCAN_GFC;      //0x1080
    uint32 CONFIG_MCAN_SIDFC;    //0x1084
    uint32 CONFIG_MCAN_XIDFC;    //0x1088
    uint32 CONFIG_MCAN_XIDAM;    //0x1090

    uint32 CONFIG_MCAN_RXF0C;    //0x10A0
    uint32 CONFIG_MCAN_RXF0S;    //0x10A4
    uint32 CONFIG_MCAN_RXF0A;    //0x10A8
    uint32 CONFIG_MCAN_RXBC;     //0x10AC
    uint32 CONFIG_MCAN_RXF1C;    //0x10B0
    uint32 CONFIG_MCAN_RXF1S;    //0x10B4
    uint32 CONFIG_MCAN_RXF1A;    //0x10B8
    uint32 CONFIG_MCAN_RXESC;    //0x10BC
    uint32 CONFIG_MCAN_TXBC;     //0x10C0
    uint32 CONFIG_MCAN_TXFQS;    //0x10C4
    uint32 CONFIG_MCAN_TXESC;    //0x10C8
    uint32 CONFIG_MCAN_TXBRP;    //0x10CC
    uint32 CONFIG_MCAN_TXBAR;    //0x10D0
    uint32 CONFIG_MCAN_TXBCR;    //0x10D4
    uint32 CONFIG_MCAN_TXBTO;    //0x10D8
    uint32 CONFIG_MCAN_TXBCF;    //0x10DC
    uint32 CONFIG_MCAN_TXBTIE;   //0x10E0
    uint32 CONFIG_MCAN_TXBCIE;   //0x10E4
    uint32 CONFIG_MCAN_TXEFC;    //0x10F0
    uint32 CONFIG_MCAN_TXEFS;    //0x10F4
    uint32 CONFIG_MCAN_TXEFA;    //0x10F8
}TCAN45x0_MCAN_config_reg_t;


//*****************************************************************************
//
//! \brief Used to setup the timing parameters of the MCAN module
//
//*****************************************************************************
typedef struct TCAN45x0_CANFD_Timing
{

	//! DBRP: The prescaler value from the MCAN system clock. Actual value is this register + 1.
	//! \n Valid range is: 0 to 31
	uint8_t DataBitRatePrescaler : 5;

	//! DTSEG1: Data time segment 1 + prop segment value. Actual value is this register + 1.
	//! \n Valid values are: 0 to 31
	uint8_t DataTimeSeg1andProp : 5;

	//! DTSEG2: Data time segment 2. Actual value is this register + 1.
	//! \n Valid values are: 0 to 15
	uint8_t DataTimeSeg2 : 4;

	//! DSJW: Data Resynchronization jump width. Actual value is this register + 1.
	//! \n Valid values are: 0 to 15
	uint8_t DataSyncJumpWidth : 4;

	//! TDCO: Transmitter delay compensation offset.
